<style type="text/css">
<!--
.стиль1 {font-style: italic}
-->
</style>
<h2>Лабораторная работа 6.1<br>
Цель</h2>
<ul>
<li>&#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1080; &#1074;&#1080;&#1088;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1077;&#1090;&#1077;&#1081;</li>
</ul>

<h2>Ход работы</h2>
<p><em>&#1055;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1082;&#1072;: &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1082;&#1085;&#1086; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093; &#1074;&#1089;&#1077;&#1093; &#1086;&#1082;&#1086;&#1085; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077; &#1075;&#1072;&#1083;&#1086;&#1095;&#1082;&#1091; <strong>Top</strong> &#1074; &#1083;&#1077;&#1074;&#1086;&#1084; &#1085;&#1080;&#1078;&#1085;&#1077;&#1084; &#1091;&#1075;&#1083;&#1091;.</em></p>
<br>
<p>
<em><b>Шаг 1. &#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; VLAN`&#1086;&#1074; &#1085;&#1072; &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1072;&#1090;&#1086;&#1088;&#1072;&#1093;.</b></em></p>

<ol>
<li>Настройка VLAN на коммутаторах Cisco производится в два этапа: создание VLAN в режиме глобальной конфигурации и назначение портов в VLAN в режиме конфигурирования интерфейса.</li>
  <li>Компьютеры PC0, PC1 и сервер требуется сделать членами VLAN 10.<br />
  Компьютеры PC2 и PC3 требуется сделать членами VLAN 20.<br />
  Компьютеры PC4 и PC5 требуется сделать членами VLAN 30.  </li>
  <li>&#1053;&#1072;&#1089;&#1090;&#1088;&#1072;&#1080;&#1074;&#1072;&#1077;&#1084; &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1072;&#1090;&#1086;&#1088; Switch0:
    <p>Switch#configure terminal<br />
      Switch(config)#vlan 10 - &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; VLAN &#1089; &#1085;&#1086;&#1084;&#1077;&#1088;&#1086;&#1084; 10<br />
      Switch(config-vlan)#exit<br />
      Switch(config)#vlan 20<br />
      Switch(config-vlan)#exit</p>
    <p><br />
      Switch(config)#int Fa 0/1<br />
      Switch(config-if)#switchport access vlan 10 - &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1084; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; &#1074; VLAN 10<br />
      Switch(config-if)#exit<br />
      Switch(config)#int Fa 0/2<br />
      Switch(config-if)#switchport access vlan 10<br />
      Switch(config-if)#exit<br />
      Switch(config)#int Fa 0/3<br />
      Switch(config-if)#switchport access vlan 20<br />
      Switch(config-if)#exit<br />
    Switch(config)#<br>
    <p>
    Настраиваем транк между коммутаторами &#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1084; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;:    </p>
   
  Switch(config)#int Gi 1/1<br />
    Switch(config-if)#switchport mode trunk  </li>
  Switch(config-if)#end<br />
    Switch#copy run start<br />
    Switch#</li>
  <li>&#1053;&#1072; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1072;&#1090;&#1086;&#1088;&#1072; Switch0 &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1090;&#1077; &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1072;&#1090;&#1086;&#1088; Switch1.</li>
</ol>
<p><em><strong>Шаг 2. Проверка &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; VLAN.</strong></em></p>
<ol>
  <li>&#1044;&#1083;&#1103; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; VLAN &#1080; &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1072;&#1097;&#1080;&#1093; &#1082; &#1085;&#1080;&#1084; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1086;&#1074; &#1091;&#1076;&#1086;&#1073;&#1085;&#1077;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; show vlan brief &#1080; show running-config. &#1044;&#1083;&#1103; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1090;&#1088;&#1072;&#1085;&#1082;&#1086;&#1074; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; show interfaces trunk.</li>
  <li>&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1099; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1083;&#1080;&#1089;&#1100; &#1074; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1084;&#1099;&#1093; VLAN, &#1082;&#1072;&#1082; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1074; &#1087;&#1091;&#1085;&#1082;&#1090;&#1077; 2 &#1064;&#1072;&#1075;&#1072; 1.</li>
</ol>
<p><em><strong>Шаг 3. &#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1088;&#1072;&#1073;&#1086;&#1095;&#1080;&#1093; &#1089;&#1090;&#1072;&#1085;&#1094;&#1080;&#1081; &#1080; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;.</strong></em></p>
<ol><li>Настройте рабочие станции согласно таблице: 
    <table width="353" border="1">
      <tr>
        <th width="77" scope="col">Станция</th>
        <th width="130" scope="col">IP-адрес</th>
        <th width="124" scope="col">Маска подсети</th>
      </tr>
      <tr>
        <td>Server0</td>
        <td>192.168.10.1</td>
        <td>255.255.255.0</td>
      </tr>
      <tr>
        <td>PC0</td>
        <td>192.168.10.2</td>
        <td>255.255.255.0</td>
      </tr>
      <tr>
        <td>PC1</td>
        <td>192.168.10.3</td>
        <td>255.255.255.0</td>
      </tr>
      <tr>
        <td>PC2</td>
        <td>192.168.20.1</td>
        <td>255.255.255.0</td>
      </tr>
      <tr>
        <td>PC3</td>
        <td>192.168.20.2</td>
        <td>255.255.255.0</td>
      </tr>
      <tr>
        <td>PC4</td>
        <td>192.168.30.1</td>
        <td>255.255.255.0</td>
      </tr>
      <tr>
        <td>PC5</td>
        <td>192.168.30.2</td>
        <td>255.255.255.0</td>
      </tr>
    </table>
    <br />
    Для этого выберите компьютер, перейдите на вкладку <strong>Desktop, </strong>щелкните <strong>IP configuration</strong> и введите необходимые значения<strong>.</strong>.  </li>
</ol>
<p><strong><em>Шаг 4. Проверка соединения.</em></strong></p>
<ol>
  <li>Убедитесь в том, что команда <strong>ping</strong> с<strong> &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1086;&#1074; </strong>до других компьютеров &#1074; &#1101;&#1090;&#1086;&#1084; &#1078;&#1077; VLAN выполняется успешно. Если это не так, проверьте правильность настройки IP-адреса, маски подсети, VLAN &#1080; &#1090;&#1088;&#1072;&#1085;&#1082;&#1086;&#1074;.</li>
  <li>&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1082;&#1072;&#1082; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1103;&#1090; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072; &#1086;&#1073;&#1086;&#1080;&#1093; &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1072;&#1090;&#1086;&#1088;&#1072;&#1093; (show mac-address-table).</li>
</ol>
<p><em><strong>Шаг 5. Проверка результатов.</strong></em></p>
<p>Нажмите кнопку <strong>Check Results</strong> чтобы проверить правильность выполнения работы.</p>
