<h2>Лабораторная работа 8.1<br>
Цель</h2>
<ul>
<li>&#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083;&#1072; OSPF</li>
</ul>

<h2>Ход работы</h2>
<p><em>&#1055;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1082;&#1072;: &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1082;&#1085;&#1086; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093; &#1074;&#1089;&#1077;&#1093; &#1086;&#1082;&#1086;&#1085; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077; &#1075;&#1072;&#1083;&#1086;&#1095;&#1082;&#1091; <strong>Top</strong> &#1074; &#1083;&#1077;&#1074;&#1086;&#1084; &#1085;&#1080;&#1078;&#1085;&#1077;&#1084; &#1091;&#1075;&#1083;&#1091;.</em></p>
<br>
<p>
<em><b>Шаг 1. &#1053;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1074;.</b></em></p>
<ol>
  <li>&#1053;&#1072;&#1079;&#1085;&#1072;&#1095;&#1090;&#1077; &#1074;&#1089;&#1077;&#1084; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1099;&#1077; IP-&#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1080;&#1079; &#1089;&#1077;&#1090;&#1077;&#1081;, &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1085;&#1072; &#1089;&#1093;&#1077;&#1084;&#1077; &#1089;&#1077;&#1090;&#1080;. &#1059;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; &#1074;&#1077;&#1088;&#1085;&#1091;&#1102; &#1084;&#1072;&#1089;&#1082;&#1091; &#1080; &#1096;&#1083;&#1102;&#1079; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1055;&#1050;. <br />
  </li>
  <li>&#1059;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1099; &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1099; (<strong>show ip interface brief</strong>).<br />
  </li>
</ol>
<p><strong><em>Шаг 2. &#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083;&#1072; OSPF.</em></strong></p>
<ol>
  <li>&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083; OSPF &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1086; (<strong>router ospf 1</strong>).<strong><br />
  </strong></li>
  <li>&#1059;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083;&#1072; (<strong>network <em>&lt;&#1072;&#1076;&#1088;&#1077;&#1089; &#1089;&#1077;&#1090;&#1080;&gt; &lt;&#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1072;&#1103; &#1084;&#1072;&#1089;&#1082;&#1072;&gt;</em> area 0</strong>).</li>
  <li>&#1059;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1072;&#1090;&#1100; Hello-&#1087;&#1072;&#1082;&#1077;&#1090;&#1099; (<strong>passive-interface</strong> <em><strong>&lt;&#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&gt;</strong></em>).</li>
  <li>&#1042;&#1099;&#1081;&#1076;&#1080;&#1090;&#1077; &#1080;&#1079; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083;&#1072; &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; (<strong>end</strong>).</li>
</ol>
<p><strong><em>Шаг 3. &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083;&#1072; OSPF.</em></strong></p>
<ol>
  <li>&#1059;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; OSPF &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085; &#1085;&#1072; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1084;&#1099;&#1093; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;&#1093; (<strong>show ip ospf interface</strong>).</li>
  <li>&#1059;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1083; &#1074;&#1089;&#1077; &#1089;&#1086;&#1089;&#1077;&#1076;&#1085;&#1080;&#1077; &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088;&#1099; &#1080; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1089;&#1086; &#1074;&#1089;&#1077;&#1084;&#1080; &#1080;&#1079; &#1085;&#1080;&#1093; &#1074; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1080; <strong>Full</strong> (<strong>show ip ospf neighbor</strong>).</li>
  <li>&#1059;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100;, &#1095;&#1090;&#1086; &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077; &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1099; &#1082;&#1086; &#1074;&#1089;&#1077;&#1084; &#1089;&#1077;&#1090;&#1103;&#1084; (<strong>show ip route</strong>).</li>
  <li>&#1056;&#1072;&#1079;&#1086;&#1088;&#1074;&#1080;&#1090;&#1077; &#1083;&#1102;&#1073;&#1086;&#1077; &#1080;&#1079; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1081; &#1084;&#1077;&#1078;&#1076;&#1091; &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088;&#1072;&#1084;&#1080; &#1080; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1082;&#1072;&#1082; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;<strong><em>.</em></strong></li>
</ol>
<p><strong><em>Шаг 4. &#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1084;&#1077;&#1090;&#1088;&#1080;&#1082;&#1080; &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1086;&#1074;.</em></strong></p>
<ol>
  <li>&#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1089;&#1090;&#1086;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; <strong><em></em></strong>&#1082;&#1072;&#1085;&#1072;&#1083;&#1086;&#1074; &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1072;&#1082;&#1077;&#1090;&#1099; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1077;&#1090;&#1103;&#1084;&#1080; 192.168.2.0 &#1080; 192.168.1.0 &#1087;&#1088;&#1086;&#1093;&#1086;&#1076;&#1080;&#1083;&#1080; &#1095;&#1077;&#1088;&#1077;&#1079; &#1074;&#1077;&#1088;&#1093;&#1085;&#1080;&#1081; &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1101;&#1090;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1072; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1086;&#1090;&#1082;&#1072;&#1079;&#1072; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1082;&#1072;&#1085;&#1072;&#1083;&#1086;&#1074; &#1055;&#1086;&#1089;&#1090;&#1099;&#1096;&#1077;&#1074;&#1072;-&#1059;&#1089;&#1089;&#1091;&#1088;&#1080;&#1081;&#1089;&#1082; &#1080;&#1083;&#1080; &#1051;&#1091;&#1075;&#1086;&#1074;&#1072;&#1103;-&#1059;&#1089;&#1089;&#1091;&#1088;&#1080;&#1081;&#1089;&#1082; - &#1087;&#1088;&#1086;&#1093;&#1086;&#1076;&#1080;&#1083;&#1080; &#1087;&#1086; &#1082;&#1072;&#1085;&#1072;&#1083;&#1091; &#1055;&#1086;&#1089;&#1090;&#1099;&#1096;&#1077;&#1074;&#1072;-&#1051;&#1091;&#1075;&#1086;&#1074;&#1072;&#1103;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077;&#1089;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081;<strong> ip ospf cost <em>&lt;&#1089;&#1090;&#1086;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100;&gt;</em> </strong>&#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1082;&#1086;&#1085;&#1092;&#1080;&#1075;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;. &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102; &#1089;&#1090;&#1086;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1082;&#1072;&#1085;&#1072;&#1083;&#1086;&#1074; &#1084;&#1086;&#1078;&#1085;&#1086; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1086;&#1081; <strong>show ip ospf interface</strong>.</li>
  <li>&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1091;&#1090;&#1080;&#1083;&#1080;&#1090;&#1086;&#1081; <strong>tracert</strong> &#1080;&#1083;&#1080; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1089;&#1080;&#1084;&#1091;&#1083;&#1103;&#1094;&#1080;&#1080;.</li>
</ol>
<p><em><strong>&#1055;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;:</strong></em></p>
<p><strong>show ip ospf database</strong><em><strong> - </strong></em>&#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1073;&#1072;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1082;&#1072;&#1085;&#1072;&#1083;&#1086;&#1074; (LSDB)</p>
<p><strong>debug ip ospf events</strong> - &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1089;&#1077;&#1093; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1081; OSPF</p>
<p><strong>undebug all </strong>- &#1074;&#1099;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</p>
<p>&nbsp;</p>
