<style type="text/css">
<!--
.стиль1 {font-style: italic}
-->
</style>
<h2>Лабораторная работа 3.1<br>
Цель</h2>
<ul>
<li>изучение процесса Ethernet коммутации</li>
</ul>

<h2>Ход работы</h2>
<p><em>&#1055;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1082;&#1072;: &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1082;&#1085;&#1086; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093; &#1074;&#1089;&#1077;&#1093; &#1086;&#1082;&#1086;&#1085; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077; &#1075;&#1072;&#1083;&#1086;&#1095;&#1082;&#1091; <strong>Top</strong> &#1074; &#1083;&#1077;&#1074;&#1086;&#1084; &#1085;&#1080;&#1078;&#1085;&#1077;&#1084; &#1091;&#1075;&#1083;&#1091;.</em></p>
<br>
<p>
<em><b>Шаг 1. Построение сети.</b></em></p>
<ol>
  <li>Создайте сеть, состоящую из моста, двух хабов и четырех компьютеров, как показано на рисунке:<br /> <img src="311.png" width="511" height="239" /></li>
  <li>Настройте рабочие станции согласно таблице: 
    <table width="353" border="1">
      <tr>
        <th width="77" scope="col">Станция</th>
        <th width="130" scope="col">IP-адрес</th>
        <th width="124" scope="col">Маска подсети</th>
      </tr>
      <tr>
        <td>PC0</td>
        <td>172.16.0.1</td>
        <td>255.255.255.0</td>
      </tr>
      <tr>
        <td>PC1</td>
        <td>172.16.0.2</td>
        <td>255.255.255.0</td>
      </tr>
      <tr>
        <td>PC2</td>
        <td>172.16.0.3</td>
        <td>255.255.255.0</td>
      </tr>
      <tr>
        <td>PC3</td>
        <td>172.16.0.4</td>
        <td>255.255.255.0</td>
      </tr>
    </table><br />
    Для этого выберите компьютер, перейдите на вкладку <strong>Desktop, </strong>щелкните <strong>IP configuration</strong> и введите необходимые значения<strong>.</strong>.  </li>
</ol>
<p><strong><em>Шаг 2. Проверка соединения.</em></strong></p>
<ol>
  <li>Убедитесь в том, что команда <strong>ping</strong> с <strong>PC0</strong> до других компьютеров выполняется успешно. Если это не так, проверьте правильность настройки IP-адреса и маски подсети.</li>
  <li>Определите MAC адрес каждого компьютера.<br>
  <ol type="a">
  <li>В командной строке (<strong>Command Prompt</strong>) введите команду<strong> ipconfg /all</strong>.</li>
  <li>Сохраните значение поля<strong> Physical Address</strong>, воспользовавшись инструментом <strong>Place Note</strong> (<img src="PlaceNote.png" width="31" height="35" />).</li>
  </ol>
  </li>
</ol>
<p class="стиль1"><strong>Шаг 3.</strong> <strong>Анализ процесса обучения моста.</strong></p>
<ol >
  <li>Отобразите таблицу MAC адресов моста:<br />
  <ol type="a">
  <li>Выберите инструмент <strong>Inspect</strong> на панели инструментов (<img src="inspect.png" width="37" height="33" />).</li>
  <li>Щелкните по мосту и в появившемся меню выберите <strong>MAC Table</strong>. Откроется таблица коммутации моста.</li>
  <li>Если в таблице присутствуют записи, подождите, пока они пропадут. Время жизни записей в таблице коммутации составляет 300 секунд. Чтобы таблица очистилась быстрее, можно несколько раз нажать кнопку <strong>Fast Forward Time</strong>, расположенную над панелью выбора устройств.</li>
  </ol>
  </li>
  <li>Перейдите в режим <strong>Simulation</strong>.</li>
  <li>В поле <strong>Visible Events </strong>(отображаемые события) нужно оставить только события <strong>ICMP</strong> ( этот протокол используется утилитой <strong>ping</strong>). Для этого нажмите кнопку <strong>Edit Filters</strong>, снимите галочку с <strong>Show All/None</strong> и поставьте галочку в поле<strong> ICMP</strong>. Щелкните в любом месте за пределами окна выбора событий чтобы закрыть окно.</li>
  <li>Выберите инструмент <strong>Add Simple PDU</strong> (<img src="AddSimplePDU.png" width="43" height="32" />) и щелкните последовательно компьютеры <strong>PC0</strong> и <strong>PC2</strong>. </li>
  <li>&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <strong>Auto Capture / Play</strong> &#1095;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1089;&#1080;&#1084;&#1091;&#1083;&#1103;&#1094;&#1080;&#1102;. &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1082;&#1072;&#1082; &#1084;&#1086;&#1089;&#1090; &#1079;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1077;&#1090; MAC &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1077;&#1083;&#1103; &#1087;&#1088;&#1080; &#1087;&#1088;&#1086;&#1093;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1080; &#1095;&#1077;&#1088;&#1077;&#1079; &#1085;&#1077;&#1075;&#1086; &#1092;&#1088;&#1077;&#1081;&#1084;&#1072;. &#1042;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1089;&#1080;&#1084;&#1091;&#1083;&#1103;&#1094;&#1080;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1091; &#1087;&#1077;&#1088;&#1077;&#1089;&#1099;&#1083;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1092;&#1088;&#1077;&#1081;&#1084;&#1072;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1084; &#1086;&#1082;&#1085;&#1077; &#1097;&#1077;&#1083;&#1082;&#1085;&#1080;&#1090;&#1077; &#1087;&#1086; &#1087;&#1077;&#1088;&#1077;&#1089;&#1099;&#1083;&#1072;&#1077;&#1084;&#1086;&#1084;&#1091; &#1092;&#1088;&#1077;&#1081;&#1084;&#1091;. &#1042; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1096;&#1077;&#1084;&#1089;&#1103; &#1086;&#1082;&#1085;&#1077; &#1074;&#1086; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1072;&#1093; <strong>Inbound PDU Details</strong> &#1080; <strong>Outbound PDU Details</strong> &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; PDU (Protocol Data Unit) &#1074;&#1089;&#1077;&#1093; &#1079;&#1072;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1087;&#1077;&#1088;&#1077;&#1089;&#1099;&#1083;&#1082;&#1077; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077;&#1081;. &#1042; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; Ethernet-&#1092;&#1088;&#1077;&#1081;&#1084;, IP-&#1087;&#1072;&#1082;&#1077;&#1090; &#1080; ICMP-&#1087;&#1072;&#1082;&#1077;&#1090;.</li>
</ol>
<p><em><strong>Шаг 4. Анализ процесса фильтрации моста.</strong></em></p>
<ol>
  <li>&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <strong>Delete</strong> &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1089;&#1080;&#1084;&#1091;&#1083;&#1103;&#1094;&#1080;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1081;.</li>
  <li>&#1042; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072; <strong>PC0</strong> &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091; <strong>ping 172.16.0.2</strong> &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1091; Enter.</li>
  <li>&#1042;&#1077;&#1088;&#1085;&#1080;&#1090;&#1077;&#1089;&#1100; &#1074; &#1086;&#1082;&#1085;&#1086; &#1089;&#1080;&#1084;&#1091;&#1083;&#1103;&#1094;&#1080;&#1080;.</li>
  <li>&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <strong>Auto Capture / Play</strong> &#1095;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1089;&#1080;&#1084;&#1091;&#1083;&#1103;&#1094;&#1080;&#1102;. &#1058;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1072;&#1094;&#1080;&#1080; &#1084;&#1086;&#1089;&#1090;&#1072; &#1087;&#1091;&#1089;&#1090;&#1072;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1092;&#1088;&#1077;&#1081;&#1084; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085; &#1074; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;, &#1072; &#1072;&#1076;&#1088;&#1077;&#1089; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1072; (PC0) &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1084;&#1077;&#1097;&#1077;&#1085; &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1072;&#1094;&#1080;&#1080;. &#1047;&#1072;&#1090;&#1077;&#1084; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1086;&#1090;&#1074;&#1077;&#1090;&#1085;&#1099;&#1081; &#1092;&#1088;&#1077;&#1081;&#1084; &#1086;&#1090; <strong>PC1</strong>. &#1040;&#1076;&#1088;&#1077;&#1089; <strong>PC1</strong> &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1084;&#1077;&#1097;&#1077;&#1085; &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1094;&#1080;&#1080;. &#1040;&#1076;&#1088;&#1077;&#1089; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1077;&#1083;&#1103; &#1084;&#1086;&#1089;&#1090; &#1091;&#1078;&#1077; &#1079;&#1085;&#1072;&#1077;&#1090; - &#1086;&#1085; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084; &#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1084; &#1087;&#1086;&#1088;&#1090;&#1091;, &#1095;&#1090;&#1086; &#1080; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;. &#1047;&#1085;&#1072;&#1095;&#1080;&#1090; &#1092;&#1088;&#1077;&#1081;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1086;&#1090;&#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1086;&#1090;&#1073;&#1088;&#1086;&#1089;&#1080;&#1090;&#1100;. &#1050;&#1086;&#1075;&#1076;&#1072; <strong>PC0</strong> &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1092;&#1088;&#1077;&#1081;&#1084; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1091; <strong>PC1</strong>, &#1084;&#1086;&#1089;&#1090; &#1101;&#1090;&#1086;&#1090; &#1092;&#1088;&#1077;&#1081;&#1084; &#1086;&#1090;&#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1091;&#1077;&#1090;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1080; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100; &#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1079;&#1072; &#1086;&#1076;&#1085;&#1080;&#1084; &#1080; &#1090;&#1077;&#1084; &#1078;&#1077; &#1087;&#1086;&#1088;&#1090;&#1086;&#1084;.</li>
</ol>
<p><em><strong>Шаг 5. Проверка результатов.</strong></em></p>
<p>Нажмите кнопку <strong>Check Results</strong> чтобы проверить правильность выполнения работы.</p>
