<style type="text/css">
<!--
.стиль1 {font-style: italic}
-->
</style>
<h2>Лабораторная работа 3.2<br>
Цель</h2>
<ul>
<li>изучение процесса Ethernet коммутации</li>
</ul>

<h2>Ход работы</h2>
<p><em>&#1055;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1082;&#1072;: &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1082;&#1085;&#1086; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093; &#1074;&#1089;&#1077;&#1093; &#1086;&#1082;&#1086;&#1085; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077; &#1075;&#1072;&#1083;&#1086;&#1095;&#1082;&#1091; <strong>Top</strong> &#1074; &#1083;&#1077;&#1074;&#1086;&#1084; &#1085;&#1080;&#1078;&#1085;&#1077;&#1084; &#1091;&#1075;&#1083;&#1091;.</em></p>
<br>
<p>
<em><b>Шаг 1. Построение сети.</b></em></p>
<ol>
  <li>Создайте сеть, состоящую из &#1090;&#1088;&#1077;&#1093; &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074; &#1080; &#1096;&#1077;&#1089;&#1090;&#1080; компьютеров, как показано на рисунке:<br />
    <img src="32.png" width="430" height="502" /></li>
  <li>Настройте рабочие станции согласно таблице: 
    <table width="353" border="1">
      <tr>
        <th width="77" scope="col">Станция</th>
        <th width="130" scope="col">IP-адрес</th>
        <th width="124" scope="col">Маска подсети</th>
      </tr>
      <tr>
        <td>PC0</td>
        <td>10.0.0.1</td>
        <td>255.0.0.0</td>
      </tr>
      <tr>
        <td>PC1</td>
        <td>10.0.0.2</td>
        <td>255.0.0.0</td>
      </tr>
      <tr>
        <td>PC2</td>
        <td>10.0.0.3</td>
        <td>255.0.0.0</td>
      </tr>
      <tr>
        <td>PC3</td>
        <td>10.0.0.4</td>
        <td>255.0.0.0</td>
      </tr>
      <tr>
        <td>PC4</td>
        <td>10.0.0.5</td>
        <td>255.0.0.0</td>
      </tr>
      <tr>
        <td>PC5<br /></td>
        <td>10.0.0.6</td>
        <td>255.0.0.0</td>
      </tr>
    </table>
  </li>
</ol>
<p><strong><em>Шаг 2. Проверка соединения.</em></strong></p>
<ol>
  <li>Убедитесь в том, что команда <strong>ping</strong> с <strong>PC0</strong> до других компьютеров выполняется успешно. Если это не так, проверьте правильность настройки IP-адреса и маски подсети.</li>
  <li>Определите MAC адрес каждого компьютера.<br>
  <ol type="a">
  <li>В командной строке (<strong>Command Prompt</strong>) введите команду<strong> ipconfg /all</strong>.</li>
  <li>Сохраните значение поля<strong> Physical Address</strong>, воспользовавшись инструментом <strong>Place Note</strong> (<img src="PlaceNote.png" width="31" height="35" />).</li>
  </ol>
  </li>
</ol>
<p class="стиль1"><strong>Шаг 3.</strong> <strong>Анализ процесса обучения &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1072;&#1090;&#1086;&#1088;&#1072;.</strong></p>
<ol >
  <li>Отобразите таблицу MAC адресов &#1074;&#1089;&#1077;&#1093; &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074;. &#1057;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1074;&#1091;&#1084;&#1103; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072;&#1084;&#1080; (&#1076;&#1083;&#1103; &#1094;&#1077;&#1083;&#1077;&#1081; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1090;&#1080;&#1090;&#1077;&#1083;&#1077;&#1085;):<br />
    <ul>
      <li>&#1057; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; инструмент&#1072; <strong>Inspect</strong>  (<img src="inspect.png" width="37" height="33" />).</li>
      <li>&#1042;&#1074;&#1077;&#1076;&#1103; &#1074; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1072;&#1090;&#1086;&#1088;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1091; <strong>show mac-address-table</strong>.</li>
    </ul>
    &#1042; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077; &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1072;&#1094;&#1080;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1085;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077; &#1076;&#1074;&#1091;&#1093; &#1079;&#1072;&#1087;&#1080;&#1089;&#1077;&#1081; (MAC-&#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1089;&#1072;&#1084;&#1080;&#1093; &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074;). Если в таблице присутству&#1077;т &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; запис&#1077;&#1081;, подождите, пока они пропадут. Время жизни записей в таблице коммутации составляет 300 секунд. Чтобы таблица очистилась быстрее, можно несколько раз нажать кнопку <strong>Fast Forward Time</strong>, расположенную над панелью выбора устройств.  </li>
  <li>Перейдите в режим <strong>Simulation</strong>.</li>
  <li>В поле <strong>Visible Events </strong>(отображаемые события) &#1086;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077; только  <strong>ICMP</strong>.</li>
  <li>Выберите инструмент <strong>Add Simple PDU</strong> (<img src="AddSimplePDU.png" width="43" height="32" />) и щелкните последовательно компьютеры <strong>PC0</strong> и <strong>PC2</strong>. </li>
  <li>&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <strong>Auto Capture / Play</strong> &#1095;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1089;&#1080;&#1084;&#1091;&#1083;&#1103;&#1094;&#1080;&#1102;. &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1082;&#1072;&#1082; &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1072;&#1090;&#1086;&#1088; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1086;&#1073;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1072;&#1094;&#1080;&#1080; &#1080; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1080; &#1087;&#1088;&#1086;&#1093;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1080; &#1095;&#1077;&#1088;&#1077;&#1079; &#1085;&#1077;&#1075;&#1086; &#1092;&#1088;&#1077;&#1081;&#1084;&#1072;. </li>
  <li>&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <strong>Delete</strong> &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1089;&#1080;&#1084;&#1091;&#1083;&#1103;&#1094;&#1080;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1081;.</li>
  <li>&#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077; &#1087;&#1091;&#1085;&#1082;&#1090;&#1099; 4 - 6 &#1076;&#1083;&#1103; &#1087;&#1072;&#1088; <strong>PC1 - PC4</strong> &#1080; <strong>PC3-PC5</strong>.</li>
  <li>&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1080;&#1085;&#1076;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1072;&#1090;&#1086;&#1088;&#1072;&#1084;&#1080; &#1075;&#1086;&#1088;&#1080;&#1090; &#1086;&#1088;&#1072;&#1085;&#1078;&#1077;&#1074;&#1099;&#1084; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084;. &#1069;&#1090;&#1086; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1090;&#1084;&#1077;&#1095;&#1077;&#1085;&#1085;&#1099;&#1081; &#1087;&#1086;&#1088;&#1090; &#1079;&#1072;&#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083;&#1086;&#1084; STP &#1076;&#1083;&#1103; &#1087;&#1088;&#1077;&#1076;&#1086;&#1090;&#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1077;&#1090;&#1083;&#1080;.</li>
</ol>
<p>Нажмите кнопку <strong>Check Results</strong> чтобы проверить правильность выполнения работы.</p>
