<style type="text/css">
<!--
.стиль1 {font-style: italic}
-->
</style>
<h2>Лабораторная работа 4.1<br>
Цель</h2>
<ul>
<li>&#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1077; &#1073;&#1077;&#1089;&#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1086;&#1081; &#1089;&#1077;&#1090;&#1080; 802.11</li>
<li>&#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1072;&#1094;&#1080;&#1080; &#1074; &#1089;&#1084;&#1077;&#1096;&#1072;&#1085;&#1085;&#1086;&#1081; Ethernet - 802.11 &#1089;&#1077;&#1090;&#1080;</li>
</ul>

<h2>Ход работы</h2>
<p><em>&#1055;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1082;&#1072;: &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1082;&#1085;&#1086; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093; &#1074;&#1089;&#1077;&#1093; &#1086;&#1082;&#1086;&#1085; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077; &#1075;&#1072;&#1083;&#1086;&#1095;&#1082;&#1091; <strong>Top</strong> &#1074; &#1083;&#1077;&#1074;&#1086;&#1084; &#1085;&#1080;&#1078;&#1085;&#1077;&#1084; &#1091;&#1075;&#1083;&#1091;.</em></p>
<br>
<p>
<em><b>Шаг 1. Построение сети.</b></em></p>
<ol>
  <li>Создайте сеть, состоящую из &#1090;&#1088;&#1077;&#1093; &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074;, двух &#1090;&#1086;&#1095;&#1077;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; (Access Point-PT), &#1076;&#1074;&#1091;&#1093; &#1085;&#1086;&#1091;&#1090;&#1073;&#1091;&#1082;&#1086;&#1074;, &#1050;&#1055;&#1050; (PDA-PT), &#1087;&#1083;&#1072;&#1085;&#1096;&#1077;&#1090;&#1085;&#1086;&#1075;&#1086; &#1055;&#1050; (TabletPC-PT), &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072; &#1080; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;, как показано на рисунке:<br />
    <img src="41.png" width="503" height="580" /></li>
  <li>Настройте рабочие станции согласно таблице: 
    <table width="353" border="1">
      <tr>
        <th width="83" scope="col">Станция</th>
        <th width="124" scope="col">IP-адрес</th>
        <th width="124" scope="col">Маска подсети</th>
      </tr>
      <tr>
        <td>Server0</td>
        <td>192.168.100.1</td>
        <td>255.255.255.0</td>
      </tr>
      <tr>
        <td>PC0</td>
        <td>192.168.100.2</td>
        <td>255.255.255.0</td>
      </tr>
      <tr>
        <td>Pda0</td>
        <td>192.168.100.3</td>
        <td>255.255.255.0</td>
      </tr>
      <tr>
        <td>Tablet PC0</td>
        <td>192.168.100.4</td>
        <td>255.255.255.0</td>
      </tr>
      <tr>
        <td>Laptop0</td>
        <td>192.168.100.5</td>
        <td>255.255.255.0</td>
      </tr>
      <tr>
        <td>Laptop1</td>
        <td>192.168.100.6</td>
        <td>255.255.255.0</td>
      </tr>
    </table><br />
    Для этого выберите компьютер, перейдите на вкладку <strong>Desktop, </strong>щелкните <strong>IP configuration</strong> и введите необходимые значения<strong>.</strong>.  </li>
</ol>
<p><strong><em>Шаг 2. Проверка соединения.</em></strong></p>
<ol>
  <li>Убедитесь в том, что команда <strong>ping</strong> с &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;<strong> PC0</strong> до &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072; <strong>Server0</strong> выполняется успешно. Если это не так, проверьте правильность настройки IP-адреса и маски подсети.</li>
  <li>Определите MAC адрес каждого компьютера.<br>
  <ol type="a">
  <li>В командной строке (<strong>Command Prompt</strong>) введите команду<strong> ipconfg /all</strong>.</li>
  <li>Сохраните значение поля<strong> Physical Address</strong>, воспользовавшись инструментом <strong>Place Note</strong> (<img src="PlaceNote.png" width="31" height="35" />).</li>
  </ol>
  </li>
</ol>
<p><strong><em>Шаг 3. Подготовка компьютеров к работе в беспроводной сети.</em></strong></p>
<p>По умолчанию ноутбуки не имеют встроенного адаптера Wi-Fi, поэтому, чтобы они могли работать в созданной сети, необходимо эти адаптеры подключить вручную:</p>
<ol>
  <li>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1085;&#1086;&#1091;&#1090;&#1073;&#1091;&#1082; &#1080; &#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1085;&#1072; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1091; <strong>Physical</strong>.</li>
  <li>&#1054;&#1090;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077; &#1087;&#1080;&#1090;&#1072;&#1085;&#1080;&#1077; &#1085;&#1086;&#1091;&#1090;&#1073;&#1091;&#1082;&#1072;, &#1085;&#1072;&#1078;&#1072;&#1074; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1087;&#1080;&#1090;&#1072;&#1085;&#1080;&#1103;.</li>
  <li>&#1055;&#1077;&#1088;&#1077;&#1090;&#1072;&#1097;&#1080;&#1090;&#1077; Ethernet-&#1072;&#1076;&#1072;&#1087;&#1090;&#1077;&#1088; &#1085;&#1086;&#1091;&#1090;&#1073;&#1091;&#1082;&#1072; &#1085;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; &#1074; &#1087;&#1088;&#1072;&#1074;&#1086;&#1084; &#1085;&#1080;&#1078;&#1085;&#1077;&#1084; &#1091;&#1075;&#1083;&#1091;.</li>
  <li>&#1042; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; <strong>PT-LAPTOP-NM-1W</strong>.</li>
  <li>&#1055;&#1077;&#1088;&#1077;&#1090;&#1072;&#1097;&#1080;&#1090;&#1077; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; &#1080;&#1079; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;, &#1083;&#1080;&#1073;&#1086; &#1077;&#1075;&#1086; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1086;&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1080;&#1074;&#1096;&#1080;&#1081;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090; &#1085;&#1086;&#1091;&#1090;&#1073;&#1091;&#1082;&#1072;.</li>
  <li>&#1042;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077; &#1087;&#1080;&#1090;&#1072;&#1085;&#1080;&#1077; &#1085;&#1086;&#1091;&#1090;&#1073;&#1091;&#1082;&#1072;, &#1085;&#1072;&#1078;&#1072;&#1074; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1087;&#1080;&#1090;&#1072;&#1085;&#1080;&#1103;.</li>
</ol>
<p><em><strong>Шаг 4. Настройка параметров беспроводной сети.</strong></em></p>
<ol>
  <li>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; <strong>BSS</strong> &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1090;&#1086;&#1095;&#1082;&#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; <strong>Access</strong> <strong>Point0</strong>:
  <ol type="a">
  <li>Выберите точку доступа <strong>Access Point0</strong>.</li>
  <li>&#1053;&#1072; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; <strong>Config</strong> &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; <strong>Port1</strong>.</li>
  <li>&#1047;&#1072;&#1076;&#1072;&#1081;&#1090;&#1077; <strong>SSID</strong>: <strong><em>Network1</em></strong>.</li>
  <li>&#1040;&#1091;&#1090;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1103; <strong>WPA2-PSK</strong>. &#1055;&#1072;&#1088;&#1086;&#1083;&#1100;&#1085;&#1072;&#1103; &#1092;&#1088;&#1072;&#1079;&#1072;: <strong><em>Network1</em></strong>.</li>
  <li>&#1058;&#1080;&#1087; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;: <strong>AES</strong>.</li>
  </ol>
  </li>
  <li>Укажите эти же параметры на <strong>Pda0</strong> и <strong>Tablet PC0</strong>. &#1045;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1074;&#1077;&#1088;&#1085;&#1086;, &#1101;&#1090;&#1080; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;&#1089;&#1103; &#1082; &#1090;&#1086;&#1095;&#1082;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; <strong>Access Point0</strong>.</li>
  <li>&#1055;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1090;&#1077; &#1090;&#1086;&#1095;&#1082;&#1091; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; <strong>Access Point1</strong> &#1080; &#1076;&#1074;&#1072; &#1085;&#1086;&#1091;&#1090;&#1073;&#1091;&#1082;&#1072;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1091;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; <strong>SSID</strong> &#1080; &#1087;&#1072;&#1088;&#1086;&#1083;&#1100;&#1085;&#1091;&#1102; &#1092;&#1088;&#1072;&#1079;&#1091;: <strong><em>Network2</em></strong>. &#1045;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1074;&#1077;&#1088;&#1085;&#1086;, &#1086;&#1073;&#1072; &#1085;&#1086;&#1091;&#1090;&#1073;&#1091;&#1082;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;&#1089;&#1103; &#1082; &#1090;&#1086;&#1095;&#1082;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; <strong>Access Point1</strong>.</li>
  <li>&#1059;&#1073;&#1077;&#1076;&#1080;&#1090;&#1077;&#1089;&#1100; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086;  команда <strong>ping</strong> с &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1073;&#1077;&#1089;&#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;<strong></strong> до &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072; <strong>Server0</strong> выполняется успешно. Если это не так, проверьте правильность настройки IP-адреса, маски подсети, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1073;&#1077;&#1089;&#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1086;&#1081; &#1089;&#1077;&#1090;&#1080;.</li>
</ol>
<p class="стиль1"><strong>Шаг 5.</strong> <strong>Анализ процесса &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1072;&#1094;&#1080;&#1080; &#1074; &#1073;&#1077;&#1089;&#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1086;&#1081; &#1089;&#1077;&#1090;&#1080;.</strong></p>
<ol >
  <li>Перейдите в режим <strong>Simulation</strong>.</li>
  <li>В поле <strong>Visible Events </strong>(отображаемые события) нужно оставить только события <strong>ICMP</strong>.</li>
  <li>Выберите инструмент <strong>Add Simple PDU</strong> (<img src="AddSimplePDU.png" width="43" height="32" />) и щелкните последовательно <strong>Pda0</strong> и <strong>Tablet PC0</strong>. </li>
  <li>&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <strong>Auto Capture / Play</strong> &#1095;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1089;&#1080;&#1084;&#1091;&#1083;&#1103;&#1094;&#1080;&#1102;. &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1090;&#1086;&#1095;&#1082;&#1072; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;, &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1086; &#1093;&#1072;&#1073;&#1091;, &#1088;&#1072;&#1089;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1099;&#1081; &#1092;&#1088;&#1077;&#1081;&#1084; &#1074;&#1089;&#1077;&#1084; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1085;&#1099;&#1084; &#1082; &#1085;&#1077;&#1081; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1084;.</li>
  <li>&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <strong>Delete</strong> &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1089;&#1080;&#1084;&#1091;&#1083;&#1103;&#1094;&#1080;&#1080;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1081;.</li>
  <li>&#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077; &#1087;&#1091;&#1085;&#1082;&#1090;&#1099; 3 - 5 &#1076;&#1083;&#1103; &#1087;&#1072;&#1088; <strong>Pda0 - Server0</strong> &#1080; <strong>Pda0 - Laptop1</strong>. &#1055;&#1088;&#1086;&#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1082;&#1086;&#1084;&#1084;&#1091;&#1090;&#1072;&#1094;&#1080;&#1080; &#1074; &#1089;&#1084;&#1077;&#1096;&#1072;&#1085;&#1085;&#1086;&#1081; &#1089;&#1077;&#1090;&#1080;.</li>
</ol>
<p><em><strong>Шаг 5. Проверка результатов.</strong></em></p>
<p>Нажмите кнопку <strong>Check Results</strong> чтобы проверить правильность выполнения работы.</p>
