<style type="text/css">
<!--
.стиль1 {font-style: italic}
-->
</style>
<h2>Лабораторная работа 5.3<br>
Цель</h2>
<ul>
<li>&#1056;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1080; &#1074;&#1085;&#1077;&#1076;&#1088;&#1077;&#1085;&#1080;&#1077; IP-&#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1080;</li>
<li>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1086;&#1074;</li>
</ul>

<h2>Ход работы</h2>
<p><em>&#1055;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1082;&#1072;: &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1082;&#1085;&#1086; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1083;&#1072;&#1073;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1085;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093; &#1074;&#1089;&#1077;&#1093; &#1086;&#1082;&#1086;&#1085; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077; &#1075;&#1072;&#1083;&#1086;&#1095;&#1082;&#1091; <strong>Top</strong> &#1074; &#1083;&#1077;&#1074;&#1086;&#1084; &#1085;&#1080;&#1078;&#1085;&#1077;&#1084; &#1091;&#1075;&#1083;&#1091;.</em></p>
<br>
<p>
<em><b>Шаг 1. &#1056;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; IP-&#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1080;.</b></em></p>
<ol>
  <li>&#1044;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1080; &#1089;&#1077;&#1090;&#1080; &#1087;&#1088;&#1077;&#1076;&#1087;&#1088;&#1080;&#1103;&#1090;&#1080;&#1103; &#1074;&#1072;&#1084; &#1073;&#1099;&#1083;&#1072; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1072; &#1089;&#1077;&#1090;&#1100; <strong>192.168.0.0/24</strong>. &#1055;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1091;&#1102; &#1089;&#1077;&#1090;&#1100; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1085;&#1072; &#1087;&#1086;&#1076;&#1089;&#1077;&#1090;&#1080; &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1083;&#1086;&#1089;&#1100; &#1082;&#1072;&#1082; &#1084;&#1080;&#1085;&#1080;&#1084;&#1091;&#1084; <strong>4 &#1087;&#1086;&#1076;&#1089;&#1077;&#1090;&#1080; &#1087;&#1086; 30 IP-&#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1074; </strong>&#1074; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081;. </li>
  <li>&#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1102;&#1102; &#1080;&#1079; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1099;&#1093; &#1087;&#1086;&#1076;&#1089;&#1077;&#1090;&#1077;&#1081; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1074; &#1089;&#1074;&#1086;&#1102; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1082;&#1072;&#1082; &#1084;&#1080;&#1085;&#1080;&#1084;&#1091;&#1084; &#1085;&#1072; <strong>3 &#1087;&#1086;&#1076;&#1089;&#1077;&#1090;&#1080; &#1087;&#1086; 2 IP-&#1072;&#1076;&#1088;&#1077;&#1089;&#1072;</strong> &#1074; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081;.<br />
  </li>
  <li>&#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1073;&#1080;&#1077;&#1085;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100;&#1089;&#1103; <strong>15</strong> &#1087;&#1086;&#1076;&#1089;&#1077;&#1090;&#1077;&#1081;.</li>
</ol>
<p><strong><em>Шаг 2. &#1042;&#1085;&#1077;&#1076;&#1088;&#1077;&#1085;&#1080;&#1077; IP-&#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1080;.</em></strong></p>
<ol>
  <li>&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1080;&#1079; <strong>&#1087;&#1077;&#1088;&#1074;&#1086;&#1081;</strong> &#1082;&#1088;&#1091;&#1087;&#1085;&#1086;&#1081; &#1087;&#1086;&#1076;&#1089;&#1077;&#1090;&#1080; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1090;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1091; <strong>Fa0/0</strong> &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088;&#1072; <strong>Router1</strong>. &#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1090;&#1077; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1091; <strong>PC1</strong>.</li>
  <li>&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1080;&#1079;<strong> &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; </strong>&#1082;&#1088;&#1091;&#1087;&#1085;&#1086;&#1081; &#1087;&#1086;&#1076;&#1089;&#1077;&#1090;&#1080; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1090;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1091; <strong>Fa0/0</strong> &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088;&#1072; <strong>Router2</strong>. &#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1090;&#1077; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1091; <strong>PC0</strong>.</li>
  <li>&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1080;&#1079; <strong>&#1090;&#1088;&#1077;&#1090;&#1100;&#1077;&#1081;</strong> &#1082;&#1088;&#1091;&#1087;&#1085;&#1086;&#1081; &#1087;&#1086;&#1076;&#1089;&#1077;&#1090;&#1080; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1090;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1091; <strong>Fa0/0</strong> &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088;&#1072; <strong>Router3</strong>. &#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1090;&#1077; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1091; <strong>PC2</strong>.</li>
  <li>&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1080;&#1079; <strong>&#1095;&#1077;&#1090;&#1074;&#1077;&#1088;&#1090;&#1086;&#1081;</strong> &#1082;&#1088;&#1091;&#1087;&#1085;&#1086;&#1081; &#1087;&#1086;&#1076;&#1089;&#1077;&#1090;&#1080; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1090;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1091; <strong>Fa0/1</strong> &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088;&#1072; <strong>Router3</strong>. &#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1090;&#1077; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1091; <strong>PC3</strong>.</li>
  <li>&#1053;&#1072; &#1074;&#1089;&#1077;&#1093; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;&#1093; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1090;&#1077; &#1074;&#1077;&#1088;&#1085;&#1099;&#1081; &#1096;&#1083;&#1102;&#1079; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;.</li>
  <li>&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; <strong>ping</strong> &#1084;&#1077;&#1078;&#1076;&#1091; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1086;&#1084; &#1080; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084; &#1096;&#1083;&#1102;&#1079;&#1086;&#1084; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1099;&#1084;.</li>
  <li>&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1080;&#1079; <strong>&#1087;&#1077;&#1088;&#1074;&#1086;&#1081;</strong> &#1084;&#1072;&#1083;&#1086;&#1081; &#1087;&#1086;&#1076;&#1089;&#1077;&#1090;&#1080; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1090;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1091; <strong>Se0/0</strong> &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088;&#1072; <strong>Router2</strong>. &#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1090;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1091; <strong>Se0/0</strong> &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088;&#1072; <strong>Router1</strong>.</li>
  <li>&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1080;&#1079;<strong> &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; </strong>&#1084;&#1072;&#1083;&#1086;&#1081; &#1087;&#1086;&#1076;&#1089;&#1077;&#1090;&#1080; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1090;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1091; <strong>Se0/1</strong> &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088;&#1072; <strong>Router1</strong>. &#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1090;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1091; <strong>Se0/0</strong> &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088;&#1072; <strong>Router3</strong>.</li>
  <li>&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1080;&#1079;<strong> &#1090;&#1088;&#1077;&#1090;&#1100;&#1077;&#1081; </strong>&#1084;&#1072;&#1083;&#1086;&#1081; &#1087;&#1086;&#1076;&#1089;&#1077;&#1090;&#1080; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1090;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1091; <strong>Se0/1</strong> &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088;&#1072; <strong>Router2</strong>. &#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1072;&#1076;&#1088;&#1077;&#1089; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1090;&#1077; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1091; <strong>Se0/1</strong> &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088;&#1072; <strong>Router3</strong>.<br>
  </li>
</ol>
<p class="стиль1"><strong>Шаг 3.</strong> <strong>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1086;&#1074;.</strong></p>
<p>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1090;&#1077; &#1085;&#1072; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084; &#1080;&#1079; &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1099; &#1082;&#1086; &#1074;&#1089;&#1077;&#1084;  &#1087;&#1086;&#1076;&#1089;&#1077;&#1090;&#1103;&#1084;, &#1082; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1086;&#1085;&#1080; &#1085;&#1077; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1099; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102;.<br />
</p>
<p><em><strong>Шаг 4. &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103;.</strong></em></p>
<p>&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1100;&#1090;&#1077; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1074;&#1089;&#1077;&#1084;&#1080; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;&#1084;&#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; ping.</p>
<p><em><strong>Шаг 5. Проверка результатов.</strong></em></p>
<p>Нажмите кнопку <strong>Check Results</strong> чтобы проверить правильность выполнения работы.</p>
